# Diccionarios y Listas en Notebboks

In [2]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'Linda'],
        'Age': [25, 30, 28, 32]
        }

df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28
3    Linda   32

In [3]:
data = [['Alice', 25], ['Bob', 30], ['Charlie', 28]]

df = pd.DataFrame(data, columns=['Name', 'Age'])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [ ]:
# Reading a CSV file into a DataFrame
df = pd.read_csv('data.csv')
print(df)

In [4]:
# using df.tail()
df.tail()
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

Applying filters

In [6]:
# Select age
df['Age']

0    25
1    30
2    28
Name: Age, dtype: int64

In [7]:
# Selection of columns
df[['Name', 'Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [8]:
df.iloc[0]

Name    Alice
Age        25
Name: 0, dtype: object

In [9]:
# Filter rows where 'Age' is greater than 25
df[df['Age'] > 25]

      Name  Age
1      Bob   30
2  Charlie   28

In [10]:
# Filter null values
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False  False